app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    if params[:artist_id] && !Artist.exists?(id: params[:artist_id])
      flash[:alert] = "Artist not found"
      redirect_to artists_path
    else
      if Song.exists?(id: params[:id])
        @song = Song.find(params[:id])